
# a = [] 数组
'''
a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]]
print(a[4])
# 输出 哈哈

a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]] 
print(a[-1][2])           #打印 数组里倒数第一个值里的下标为2的值
# 输出 2333  
'''
'''
#a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]] 
print(a.append("啊啊")) #在数组中追加数据    也可以写 a.append("啊啊")      #append 阿盆得
                                                    print(a)      

输出 [1, 1, 1, 2, '哈哈', '嘻嘻', [1, 2, 2333], '啊啊']
'''
'''
#a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]]
a.insert(1,"啊啊")     在数组中插入数据    (1,"啊啊") 1是要插入位置的下标   "啊啊"为插入的值
print(a)
输出[1, '啊啊', 1, 1, 2, '哈哈', '嘻嘻', [1, 2, 2333]]

#b = (1,2,3,[1,2,3])
b[-1].append("哈哈")       在b元祖的最后一个数组中追加数据  "哈哈"
print(b)
输出(1, 2, 3, [1, 2, 3, '哈哈'])
'''
'''
a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]]
a.pop(-1)    #pop() 函数用于移除列表中的一个元素（默认最后一个元素），并且返回该元素的值。
print(a)
输出 [1, 1, 1, 2, '哈哈', '嘻嘻']


a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]]
a.clear()     # clear  可林儿  清空
print(a) 
输出[]
'''
'''
a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]]
c = [1,2,3,4,5,6]
a.extend(c)       #extend 一可疼得 extend() 函数用于在列表末尾一次性追加另一个序列中的多个值（用新列表扩展原来的列表）。
print(a)
#输出[1, 1, 1, 2, '哈哈', '嘻嘻', [1, 2, 2333]]

a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]]
a.extend("哈哈哈")   #extend 一可疼得 会吧字符串拆开，拆成每一个都是独立的值 然后并到数组里来
print(a)
#输出 [1, 1, 1, 2, '哈哈', '嘻嘻', [1, 2, 2333], '哈', '哈', '哈']
'''
'''
a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]]
c = a.copy()  #copy() 函数返回一个字典的浅复制。
print(c)
输出 [1, 1, 1, 2, '哈哈', '嘻嘻', [1, 2, 2333]
'''
'''
a = [1,1,1,2,"哈哈","嘻嘻",[1,2,2333]]
del a[3]  #del删除 想删哪个就写他的下标
print(a)
[1, 1, 1, '哈哈', '嘻嘻', [1, 2, 2333]]
'''
'''
a = "今天吃了吗"
a.format() #格式化字符串    佛马特

name = input("请输入你的名字")
aihao = input("请输入你的爱好")
job = input("请输入你的职业")
print("大家好{},是{},我的爱好是{}".format(name,job,aihao))
#输出 大家好蔡徐坤,是练习生,我的爱好是唱，跳，rap和篮球

name = input("请输入你的名字")
aihao = input("请输入你的爱好")
job = input("请输入你的职业")
print("大家好{},是{},我的爱好是{},{},{},{}".format(name,job,aihao,name,name,name))
# 输出 大家好蔡徐坤,是练习生,我的爱好是唱，跳，rap和篮球,蔡徐坤,蔡徐坤,蔡徐坤
'''
name = input("请输入你的名字")
aihao = input("请输入你的爱好")
job = input("请输入你的职业")
print("大家好{name},是{job},我的爱好是{aihao},\
{name},{name},{name}".format(name=name,job=job,aihao=aihao))
输出大家好蔡徐坤,是练习生,我的爱好是唱，跳，rap篮球,蔡徐坤,蔡徐坤,蔡徐坤

