'''
print("He1lo World!")   #字符串
print( 23333)   #整数
print(2.333)    #小数
print(True)     #布尔值
print(None)     #空
print(())       #元组
print([])       #数组
print({})       #字典

print( "哈哈" ,2333,True,"(●'v'o)")

print( "哈哈"+"嘿嘿" )
#输出 哈哈嘿嘿

 # 变量    赋值

num  = 2333  # 把"2333这个值赋值给了 num这个变量

print(num)
输出 2333
'''

'''
a = input("输入",)
b = input("输入",)
print(a+b)
print(type(a))   #type 输出数据的类型
#输入12
#输入12
#输出1212

#用 int 进行字符转换成整数实现加法
a = input("输入",)
b = input("输入",)
print(int(a)+int(b))
#输入12
#输入12
#输出24

#第二种写法
a = int(input("输入",))
b = int(input("输入",))
print(a+b)
#输入12
#输入12
#输出24
'''

'''
#len 计算输出字符串、元祖、数组、字典的长度
c = "abc"
print(len(c))
#输出 3
'''

'''
a = (1,2,3,"哈哈","嘻嘻") #下标
print(a[3])
输出 哈哈
'''
'''
a = (1,2,3,"哈哈","嘻嘻") #下标
print(a[3],a[4],a[0])    #打印出对应下标的值
输出 哈哈  嘻嘻  1
'''
'''
a = (1,2,3,"哈哈","嘻嘻")
print(a[0:3]) #左闭右开   打印的从0下标开始的3个值
'''

'''
a = (1,2,3,"哈哈","嘻嘻","哈哈","哈哈","哈哈","哈哈","呜呜","哈哈") #下标

print(a.index("呜呜"))   #用index计算出下标位置
输出 9
'''
'''
a = (1,2,3,"哈哈","嘻嘻","哈哈","哈哈","哈哈","哈哈","呜呜","哈哈") #下标 

tongji = a.count("哈哈")    #count 统计元祖里有多少个 哈哈

print(tongji)
输出 6
'''
'''
b = ((1,"张三"),(2,"李四")) #二维元祖

print(b[0][1])  #[0]是(1,"张三")这个元祖 ,[1]是指(1,"张三")这个元祖里下标为1的张三这个值
输出 张三
'''